<h1>Learn Pandas<h1>

<h2>Pandas Series</h2>

In [4]:
import numpy as np
import pandas as pd

In [ ]:
#help(pd.Series)

In [6]:
country = ['USA','Canada','Mexico']
independence = [1776,1888, 1989]
series = pd.Series(data=independence,index=country)
series

USA       1776
Canada    1888
Mexico    1989
dtype: int64

In [8]:
country_independence = {'USA': 1776, 'Canada':1888, 'Mexico':1989}
seriesfromdictionary = pd.Series(country_independence)

In [9]:
seriesfromdictionary

USA       1776
Canada    1888
Mexico    1989
dtype: int64

In [10]:
def increaseyear(year):
    return year+1

In [18]:
seriesfromdictionary = seriesfromdictionary.apply(increaseyear)
seriesfromdictionary

USA       1778
Canada    1890
Mexico    1991
dtype: int64

In [19]:
seriesfromdictionary.apply(lambda year: year + 1)

USA       1779
Canada    1891
Mexico    1992
dtype: int64

In [20]:
# sales data of the country
q1 = {'Japan' : 80, 'USA' : 250, 'China': 450, 'India':200}
q2 = {'Brazil' : 100, 'USA' : 260, 'China': 500, 'India':210}

In [21]:
q1_ser = pd.Series(q1)
q2_ser = pd.Series(q2)

In [22]:
q1_ser

Japan     80
USA      250
China    450
India    200
dtype: int64

In [23]:
q2_ser

Brazil    100
USA       260
China     500
India     210
dtype: int64

In [24]:
q2_ser.keys()

Index(['Brazil', 'USA', 'China', 'India'], dtype='object')

In [25]:
type(q2_ser)

pandas.core.series.Series

In [26]:
q2_ser /100

Brazil    1.0
USA       2.6
China     5.0
India     2.1
dtype: float64

In [27]:
q2_ser + 1

Brazil    101
USA       261
China     501
India     211
dtype: int64

In [29]:
q1_ser + q2_ser

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [31]:
q1_ser.add(q2_ser,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

<h2>Data Frame<h2>

In [32]:
# create data with seed to make
# sure it generates same data
np.random.seed(101)
data = np.random.randint(0,101,(4,3))

In [33]:
# print data
data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [34]:
# create index representing different cities of US
myindex = ['CA','NY','AZ','TX']
# create columns as tax collection for 3 months
mycolumns = ['Jan','Feb','Mar']

In [37]:
df = pd.DataFrame(data=data,index = myindex,columns=mycolumns)

In [38]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [40]:
pwd

'C:\\Users\\rupak'

In [1]:
pwd

'C:\\Users\\rupak\\data-science\\pandas'

In [2]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 1654-94C6

 Directory of C:\Users\rupak\data-science\pandas

18-10-2022  16:16    <DIR>          .
18-10-2022  16:13    <DIR>          ..
18-10-2022  16:14    <DIR>          .ipynb_checkpoints
18-10-2022  16:11            11,831 pandas.ipynb
28-01-2020  02:58            18,752 tips.csv
               2 File(s)         30,583 bytes
               3 Dir(s)  416,034,738,176 bytes free

In [10]:
df = pd.read_csv('tips.csv')

In [11]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB